backend: tensorflow
class_name: Functional
config:
  input_layers:
  - - input_1
    - 0
    - 0
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple
      - null
      - null
      - null
      - 3
      dtype: float32
      name: input_1
      ragged: false
      sparse: false
    inbound_nodes: []
    name: input_1
  - class_name: ZeroPadding2D
    config:
      data_format: channels_last
      dtype: float32
      name: padding_conv1
      padding: !!python/tuple
      - !!python/tuple
        - 3
        - 3
      - !!python/tuple
        - 3
        - 3
      trainable: true
    inbound_nodes:
    - - - input_1
        - 0
        - 0
        - {}
    name: padding_conv1
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 64
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 7
      - 7
      name: conv1
      padding: valid
      strides: !!python/tuple
      - 2
      - 2
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - padding_conv1
        - 0
        - 0
        - {}
    name: conv1
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 1.0e-05
      freeze: true
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn_conv1
      scale: true
      trainable: false
    inbound_nodes:
    - - - conv1
        - 0
        - 0
        - {}
    name: bn_conv1
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: conv1_relu
      trainable: true
    inbound_nodes:
    - - - bn_conv1
        - 0
        - 0
        - {}
    name: conv1_relu
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      dtype: float32
      name: pool1
      padding: same
      pool_size: !!python/tuple
      - 3
      - 3
      strides: !!python/tuple
      - 2
      - 2
      trainable: true
    inbound_nodes:
    - - - conv1_relu
        - 0
        - 0
        - {}
    name: pool1
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 64
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: truncated_normal
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 1
      - 1
      name: res2a_branch2a
      padding: valid
      strides: !!python/tuple
      - 1
      - 1
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - pool1
        - 0
        - 0
        - {}
    name: res2a_branch2a
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 1.0e-05
      freeze: true
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2a_branch2a
      scale: true
      trainable: false
    inbound_nodes:
    - - - res2a_branch2a
        - 0
        - 0
        - {}
    name: bn2a_branch2a
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: res2a_branch2a_relu
      trainable: true
    inbound_nodes:
    - - - bn2a_branch2a
        - 0
        - 0
        - {}
    name: res2a_branch2a_relu
  - class_name: ZeroPadding2D
    config:
      data_format: channels_last
      dtype: float32
      name: padding2a_branch2b
      padding: !!python/tuple
      - !!python/tuple
        - 1
        - 1
      - !!python/tuple
        - 1
        - 1
      trainable: true
    inbound_nodes:
    - - - res2a_branch2a_relu
        - 0
        - 0
        - {}
    name: padding2a_branch2b
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 64
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: truncated_normal
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: res2a_branch2b
      padding: valid
      strides: !!python/tuple
      - 1
      - 1
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - padding2a_branch2b
        - 0
        - 0
        - {}
    name: res2a_branch2b
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 1.0e-05
      freeze: true
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2a_branch2b
      scale: true
      trainable: false
    inbound_nodes:
    - - - res2a_branch2b
        - 0
        - 0
        - {}
    name: bn2a_branch2b
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: res2a_branch2b_relu
      trainable: true
    inbound_nodes:
    - - - bn2a_branch2b
        - 0
        - 0
        - {}
    name: res2a_branch2b_relu
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 256
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: truncated_normal
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 1
      - 1
      name: res2a_branch2c
      padding: valid
      strides: !!python/tuple
      - 1
      - 1
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - res2a_branch2b_relu
        - 0
        - 0
        - {}
    name: res2a_branch2c
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 256
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: truncated_normal
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 1
      - 1
      name: res2a_branch1
      padding: valid
      strides: !!python/tuple
      - 1
      - 1
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - pool1
        - 0
        - 0
        - {}
    name: res2a_branch1
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 1.0e-05
      freeze: true
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2a_branch2c
      scale: true
      trainable: false
    inbound_nodes:
    - - - res2a_branch2c
        - 0
        - 0
        - {}
    name: bn2a_branch2c
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 1.0e-05
      freeze: true
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2a_branch1
      scale: true
      trainable: false
    inbound_nodes:
    - - - res2a_branch1
        - 0
        - 0
        - {}
    name: bn2a_branch1
  - class_name: Add
    config:
      dtype: float32
      name: res2a
      trainable: true
    inbound_nodes:
    - - - bn2a_branch2c
        - 0
        - 0
        - &id001 {}
      - - bn2a_branch1
        - 0
        - 0
        - *id001
    name: res2a
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: res2a_relu
      trainable: true
    inbound_nodes:
    - - - res2a
        - 0
        - 0
        - {}
    name: res2a_relu
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 64
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: truncated_normal
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 1
      - 1
      name: res2b_branch2a
      padding: valid
      strides: !!python/tuple
      - 1
      - 1
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - res2a_relu
        - 0
        - 0
        - {}
    name: res2b_branch2a
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 1.0e-05
      freeze: true
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2b_branch2a
      scale: true
      trainable: false
    inbound_nodes:
    - - - res2b_branch2a
        - 0
        - 0
        - {}
    name: bn2b_branch2a
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: res2b_branch2a_relu
      trainable: true
    inbound_nodes:
    - - - bn2b_branch2a
        - 0
        - 0
        - {}
    name: res2b_branch2a_relu
  - class_name: ZeroPadding2D
    config:
      data_format: channels_last
      dtype: float32
      name: padding2b_branch2b
      padding: !!python/tuple
      - !!python/tuple
        - 1
        - 1
      - !!python/tuple
        - 1
        - 1
      trainable: true
    inbound_nodes:
    - - - res2b_branch2a_relu
        - 0
        - 0
        - {}
    name: padding2b_branch2b
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 64
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: truncated_normal
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: res2b_branch2b
      padding: valid
      strides: !!python/tuple
      - 1
      - 1
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - padding2b_branch2b
        - 0
        - 0
        - {}
    name: res2b_branch2b
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 1.0e-05
      freeze: true
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2b_branch2b
      scale: true
      trainable: false
    inbound_nodes:
    - - - res2b_branch2b
        - 0
        - 0
        - {}
    name: bn2b_branch2b
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: res2b_branch2b_relu
      trainable: true
    inbound_nodes:
    - - - bn2b_branch2b
        - 0
        - 0
        - {}
    name: res2b_branch2b_relu
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 256
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: truncated_normal
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 1
      - 1
      name: res2b_branch2c
      padding: valid
      strides: !!python/tuple
      - 1
      - 1
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - res2b_branch2b_relu
        - 0
        - 0
        - {}
    name: res2b_branch2c
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 1.0e-05
      freeze: true
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2b_branch2c
      scale: true
      trainable: false
    inbound_nodes:
    - - - res2b_branch2c
        - 0
        - 0
        - {}
    name: bn2b_branch2c
  - class_name: Add
    config:
      dtype: float32
      name: res2b
      trainable: true
    inbound_nodes:
    - - - bn2b_branch2c
        - 0
        - 0
        - &id002 {}
      - - res2a_relu
        - 0
        - 0
        - *id002
    name: res2b
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: res2b_relu
      trainable: true
    inbound_nodes:
    - - - res2b
        - 0
        - 0
        - {}
    name: res2b_relu
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 64
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: truncated_normal
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 1
      - 1
      name: res2c_branch2a
      padding: valid
      strides: !!python/tuple
      - 1
      - 1
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - res2b_relu
        - 0
        - 0
        - {}
    name: res2c_branch2a
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 1.0e-05
      freeze: true
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2c_branch2a
      scale: true
      trainable: false
    inbound_nodes:
    - - - res2c_branch2a
        - 0
        - 0
        - {}
    name: bn2c_branch2a
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: res2c_branch2a_relu
      trainable: true
    inbound_nodes:
    - - - bn2c_branch2a
        - 0
        - 0
        - {}
    name: res2c_branch2a_relu
  - class_name: ZeroPadding2D
    config:
      data_format: channels_last
      dtype: float32
      name: padding2c_branch2b
      padding: !!python/tuple
      - !!python/tuple
        - 1
        - 1
      - !!python/tuple
        - 1
        - 1
      trainable: true
    inbound_nodes:
    - - - res2c_branch2a_relu
        - 0
        - 0
        - {}
    name: padding2c_branch2b
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 64
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: truncated_normal
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: res2c_branch2b
      padding: valid
      strides: !!python/tuple
      - 1
      - 1
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - padding2c_branch2b
        - 0
        - 0
        - {}
    name: res2c_branch2b
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 1.0e-05
      freeze: true
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2c_branch2b
      scale: true
      trainable: false
    inbound_nodes:
    - - - res2c_branch2b
        - 0
        - 0
        - {}
    name: bn2c_branch2b
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: res2c_branch2b_relu
      trainable: true
    inbound_nodes:
    - - - bn2c_branch2b
        - 0
        - 0
        - {}
    name: res2c_branch2b_relu
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 256
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: truncated_normal
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 1
      - 1
      name: res2c_branch2c
      padding: valid
      strides: !!python/tuple
      - 1
      - 1
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - res2c_branch2b_relu
        - 0
        - 0
        - {}
    name: res2c_branch2c
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 1.0e-05
      freeze: true
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2c_branch2c
      scale: true
      trainable: false
    inbound_nodes:
    - - - res2c_branch2c
        - 0
        - 0
        - {}
    name: bn2c_branch2c
  - class_name: Add
    config:
      dtype: float32
      name: res2c
      trainable: true
    inbound_nodes:
    - - - bn2c_branch2c
        - 0
        - 0
        - &id003 {}
      - - res2b_relu
        - 0
        - 0
        - *id003
    name: res2c
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: res2c_relu
      trainable: true
    inbound_nodes:
    - - - res2c
        - 0
        - 0
        - {}
    name: res2c_relu
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 128
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: truncated_normal
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 1
      - 1
      name: res3a_branch2a
      padding: valid
      strides: !!python/tuple
      - 2
      - 2
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - res2c_relu
        - 0
        - 0
        - {}
    name: res3a_branch2a
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 1.0e-05
      freeze: true
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3a_branch2a
      scale: true
      trainable: false
    inbound_nodes:
    - - - res3a_branch2a
        - 0
        - 0
        - {}
    name: bn3a_branch2a
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: res3a_branch2a_relu
      trainable: true
    inbound_nodes:
    - - - bn3a_branch2a
        - 0
        - 0
        - {}
    name: res3a_branch2a_relu
  - class_name: ZeroPadding2D
    config:
      data_format: channels_last
      dtype: float32
      name: padding3a_branch2b
      padding: !!python/tuple
      - !!python/tuple
        - 1
        - 1
      - !!python/tuple
        - 1
        - 1
      trainable: true
    inbound_nodes:
    - - - res3a_branch2a_relu
        - 0
        - 0
        - {}
    name: padding3a_branch2b
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 128
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: truncated_normal
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: res3a_branch2b
      padding: valid
      strides: !!python/tuple
      - 1
      - 1
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - padding3a_branch2b
        - 0
        - 0
        - {}
    name: res3a_branch2b
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 1.0e-05
      freeze: true
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3a_branch2b
      scale: true
      trainable: false
    inbound_nodes:
    - - - res3a_branch2b
        - 0
        - 0
        - {}
    name: bn3a_branch2b
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: res3a_branch2b_relu
      trainable: true
    inbound_nodes:
    - - - bn3a_branch2b
        - 0
        - 0
        - {}
    name: res3a_branch2b_relu
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 512
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: truncated_normal
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 1
      - 1
      name: res3a_branch2c
      padding: valid
      strides: !!python/tuple
      - 1
      - 1
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - res3a_branch2b_relu
        - 0
        - 0
        - {}
    name: res3a_branch2c
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 512
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: truncated_normal
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 1
      - 1
      name: res3a_branch1
      padding: valid
      strides: !!python/tuple
      - 2
      - 2
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - res2c_relu
        - 0
        - 0
        - {}
    name: res3a_branch1
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 1.0e-05
      freeze: true
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3a_branch2c
      scale: true
      trainable: false
    inbound_nodes:
    - - - res3a_branch2c
        - 0
        - 0
        - {}
    name: bn3a_branch2c
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 1.0e-05
      freeze: true
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3a_branch1
      scale: true
      trainable: false
    inbound_nodes:
    - - - res3a_branch1
        - 0
        - 0
        - {}
    name: bn3a_branch1
  - class_name: Add
    config:
      dtype: float32
      name: res3a
      trainable: true
    inbound_nodes:
    - - - bn3a_branch2c
        - 0
        - 0
        - &id004 {}
      - - bn3a_branch1
        - 0
        - 0
        - *id004
    name: res3a
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: res3a_relu
      trainable: true
    inbound_nodes:
    - - - res3a
        - 0
        - 0
        - {}
    name: res3a_relu
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 128
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: truncated_normal
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 1
      - 1
      name: res3b_branch2a
      padding: valid
      strides: !!python/tuple
      - 1
      - 1
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - res3a_relu
        - 0
        - 0
        - {}
    name: res3b_branch2a
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 1.0e-05
      freeze: true
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3b_branch2a
      scale: true
      trainable: false
    inbound_nodes:
    - - - res3b_branch2a
        - 0
        - 0
        - {}
    name: bn3b_branch2a
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: res3b_branch2a_relu
      trainable: true
    inbound_nodes:
    - - - bn3b_branch2a
        - 0
        - 0
        - {}
    name: res3b_branch2a_relu
  - class_name: ZeroPadding2D
    config:
      data_format: channels_last
      dtype: float32
      name: padding3b_branch2b
      padding: !!python/tuple
      - !!python/tuple
        - 1
        - 1
      - !!python/tuple
        - 1
        - 1
      trainable: true
    inbound_nodes:
    - - - res3b_branch2a_relu
        - 0
        - 0
        - {}
    name: padding3b_branch2b
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 128
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: truncated_normal
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: res3b_branch2b
      padding: valid
      strides: !!python/tuple
      - 1
      - 1
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - padding3b_branch2b
        - 0
        - 0
        - {}
    name: res3b_branch2b
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 1.0e-05
      freeze: true
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3b_branch2b
      scale: true
      trainable: false
    inbound_nodes:
    - - - res3b_branch2b
        - 0
        - 0
        - {}
    name: bn3b_branch2b
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: res3b_branch2b_relu
      trainable: true
    inbound_nodes:
    - - - bn3b_branch2b
        - 0
        - 0
        - {}
    name: res3b_branch2b_relu
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 512
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: truncated_normal
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 1
      - 1
      name: res3b_branch2c
      padding: valid
      strides: !!python/tuple
      - 1
      - 1
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - res3b_branch2b_relu
        - 0
        - 0
        - {}
    name: res3b_branch2c
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 1.0e-05
      freeze: true
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3b_branch2c
      scale: true
      trainable: false
    inbound_nodes:
    - - - res3b_branch2c
        - 0
        - 0
        - {}
    name: bn3b_branch2c
  - class_name: Add
    config:
      dtype: float32
      name: res3b
      trainable: true
    inbound_nodes:
    - - - bn3b_branch2c
        - 0
        - 0
        - &id005 {}
      - - res3a_relu
        - 0
        - 0
        - *id005
    name: res3b
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: res3b_relu
      trainable: true
    inbound_nodes:
    - - - res3b
        - 0
        - 0
        - {}
    name: res3b_relu
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 128
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: truncated_normal
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 1
      - 1
      name: res3c_branch2a
      padding: valid
      strides: !!python/tuple
      - 1
      - 1
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - res3b_relu
        - 0
        - 0
        - {}
    name: res3c_branch2a
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 1.0e-05
      freeze: true
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3c_branch2a
      scale: true
      trainable: false
    inbound_nodes:
    - - - res3c_branch2a
        - 0
        - 0
        - {}
    name: bn3c_branch2a
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: res3c_branch2a_relu
      trainable: true
    inbound_nodes:
    - - - bn3c_branch2a
        - 0
        - 0
        - {}
    name: res3c_branch2a_relu
  - class_name: ZeroPadding2D
    config:
      data_format: channels_last
      dtype: float32
      name: padding3c_branch2b
      padding: !!python/tuple
      - !!python/tuple
        - 1
        - 1
      - !!python/tuple
        - 1
        - 1
      trainable: true
    inbound_nodes:
    - - - res3c_branch2a_relu
        - 0
        - 0
        - {}
    name: padding3c_branch2b
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 128
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: truncated_normal
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: res3c_branch2b
      padding: valid
      strides: !!python/tuple
      - 1
      - 1
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - padding3c_branch2b
        - 0
        - 0
        - {}
    name: res3c_branch2b
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 1.0e-05
      freeze: true
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3c_branch2b
      scale: true
      trainable: false
    inbound_nodes:
    - - - res3c_branch2b
        - 0
        - 0
        - {}
    name: bn3c_branch2b
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: res3c_branch2b_relu
      trainable: true
    inbound_nodes:
    - - - bn3c_branch2b
        - 0
        - 0
        - {}
    name: res3c_branch2b_relu
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 512
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: truncated_normal
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 1
      - 1
      name: res3c_branch2c
      padding: valid
      strides: !!python/tuple
      - 1
      - 1
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - res3c_branch2b_relu
        - 0
        - 0
        - {}
    name: res3c_branch2c
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 1.0e-05
      freeze: true
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3c_branch2c
      scale: true
      trainable: false
    inbound_nodes:
    - - - res3c_branch2c
        - 0
        - 0
        - {}
    name: bn3c_branch2c
  - class_name: Add
    config:
      dtype: float32
      name: res3c
      trainable: true
    inbound_nodes:
    - - - bn3c_branch2c
        - 0
        - 0
        - &id006 {}
      - - res3b_relu
        - 0
        - 0
        - *id006
    name: res3c
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: res3c_relu
      trainable: true
    inbound_nodes:
    - - - res3c
        - 0
        - 0
        - {}
    name: res3c_relu
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 128
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: truncated_normal
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 1
      - 1
      name: res3d_branch2a
      padding: valid
      strides: !!python/tuple
      - 1
      - 1
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - res3c_relu
        - 0
        - 0
        - {}
    name: res3d_branch2a
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 1.0e-05
      freeze: true
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3d_branch2a
      scale: true
      trainable: false
    inbound_nodes:
    - - - res3d_branch2a
        - 0
        - 0
        - {}
    name: bn3d_branch2a
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: res3d_branch2a_relu
      trainable: true
    inbound_nodes:
    - - - bn3d_branch2a
        - 0
        - 0
        - {}
    name: res3d_branch2a_relu
  - class_name: ZeroPadding2D
    config:
      data_format: channels_last
      dtype: float32
      name: padding3d_branch2b
      padding: !!python/tuple
      - !!python/tuple
        - 1
        - 1
      - !!python/tuple
        - 1
        - 1
      trainable: true
    inbound_nodes:
    - - - res3d_branch2a_relu
        - 0
        - 0
        - {}
    name: padding3d_branch2b
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 128
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: truncated_normal
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: res3d_branch2b
      padding: valid
      strides: !!python/tuple
      - 1
      - 1
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - padding3d_branch2b
        - 0
        - 0
        - {}
    name: res3d_branch2b
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 1.0e-05
      freeze: true
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
